let a = [
    {
        "id": 1,
        "name": "Освіта/Педагогіка",
        "emoji": "🎓"
    },
    {
        "id": 2,
        "name": "Культура і мистецтво",
        "emoji": "🎭"
    },
    {
        "id": 3,
        "name": "Гуманітарні науки",
        "emoji": "📘"
    }
]

let b = [
    {
        "code": 11,
        "name": "Освітні, педагогічні науки",
        "emoji": "🎓",
        "field_id": 1
    },
    {
        "code": 12,
        "name": "Дошкільна освіта",
        "emoji": "👦",
        "field_id": 1
    },
    {
        "code": 13,
        "name": "Початкова освіта",
        "emoji": "🏫",
        "field_id": 1
    },
    {
        "code": 14,
        "name": "Середня освіта",
        "emoji": "🧑‍🏫",
        "field_id": 1
    },
    {
        "code": 15,
        "name": "Професійна освіта",
        "emoji": "👨‍🏫",
        "field_id": 1
    },
    {
        "code": 16,
        "name": "Спеціальна освіта",
        "emoji": "🧑‍🎓",
        "field_id": 1
    },
    {
        "code": 17,
        "name": "Фізична культура і спорт",
        "emoji": "👟",
        "field_id": 1
    },
    {
        "code": 21,
        "name": "Аудіовізуальне мистецтво та виробництво",
        "emoji": "🔊",
        "field_id": 2
    },
    {
        "code": 22,
        "name": "Дизайн",
        "emoji": "✨",
        "field_id": 2
    },
    {
        "code": 23,
        "name": "Образотворче мистецтво, декоративне мистецтво, реставрація",
        "emoji": "🎨",
        "field_id": 2
    },
    {
        "code": 24,
        "name": "Хореографія",
        "emoji": "💃",
        "field_id": 2
    },
    {
        "code": 25,
        "name": "Музичне мистецтво",
        "emoji": "🎵",
        "field_id": 2
    },
    {
        "code": 26,
        "name": "Сценічне мистецтво",
        "emoji": "🎭",
        "field_id": 2
    },
    {
        "code": 27,
        "name": "Музеєзнавство, пам’яткознавство",
        "emoji": "🏛",
        "field_id": 2
    },
    {
        "code": 28,
        "name": "Менеджмент соціокультурної діяльності",
        "emoji": "💼",
        "field_id": 2
    },
    {
        "code": 29,
        "name": "Інформаційна, бібліотечна та архівна справа",
        "emoji": "📚",
        "field_id": 2
    },
    {
        "code": 31,
        "name": "Релігієзнавство",
        "emoji": "🙏",
        "field_id": 3
    },
    {
        "code": 32,
        "name": "Історія та археологія",
        "emoji": "🏺",
        "field_id": 3
    },
    {
        "code": 33,
        "name": "Філософія",
        "emoji": "🌌",
        "field_id": 3
    },
    {
        "code": 34,
        "name": "Культурологія",
        "emoji": "🐉",
        "field_id": 3
    },
    {
        "code": 35,
        "name": "Філологія",
        "emoji": "🔤",
        "field_id": 3
    }
]

// for(let i =0; i < a.length; i++){
//     for(let j = 0; j< b.length; j++){
//         if(a[i]['field_id'])

//     }
// }
console.log(a[1]['id'])